["Former subgenera", "Rhododendron  pl. rhododendra is a very large of about 1,024 of woody plants and in the Ericaceae. They can be either or . Most species are native to eastern Asia and the region, but smaller numbers occur elsewhere in Asia, and in North America, Europe and Australia.", "It is the of , the of and in the United States, the state flower of and in India, the provincial flower of in South Korea, the provincial flower of in China and the of and in India. Most species have brightly colored flowers which bloom from late winter through to early summer.", "make up two subgenera of Rhododendron. They are distinguished from true rhododendrons by having only five per flower.", "The common and generic name comes from rhódon rose and déndron tree.", "Rhododendron is a genus of and small to rarely large , the smallest species growing to 10100 cm 440 in tall, and the largest, , reported to 30 m 100 ft tall. The are spirally arranged leaf size can range from 12 cm 0.40.8 in to over 50 cm 20 in, exceptionally 100 cm 40 in in . They may be either or . In some species, the undersides of the leaves are covered with scales lepidote or hairs indumentum. Some of the best known species are noted for their many clusters of large flowers. A recently discovered species in New Guinea has flowers up to six inches fifteen centimeters in width, the largest in the whole genus. The accompanying photograph shows it as having seven . There are alpine species with small flowers and small leaves, and tropical species such as that often grow as . Species in this genus may be part of the heath complex in in eastern North America.", "They have frequently been divided based on the presence or absence of scales on the abaxial lower leaf surface  or elepidote. These scales, unique to subgenus Rhododendron, are modified hairs consisting of a polygonal scale attached by a stalk.", "Rhododendron are characterised by having with scarious dry , a of x13, that has a , an that is superior or nearly so, that have no appendages, and clumped .", "Rhododendron is the largest genus in the family , with over 1,000 species, though estimates vary from 850 to 1,200 and is diverse. Consequently, the has been historically complex.", "Although Rhododendrons had been known since the description of by Clusius in the sixteenth century, and were known to classical writers Magor 1990, and referred to as Chamaerhododendron lowgrowing rose tree, the genus was first formally described by in his in 1753. He listed five species under Rhododendron the , , , R. chamaecistus now L. Rchb. and . At that time he considered the then known six species of that he had described earlier in 1735 in his as a separate genus.", "Linnaeus six species of Azalea were , , , , and A. procumbens now , which he distinguished from Rhododendron by having five , as opposed to ten. As new species of what are now considered Rhododendron were discovered, they were assigned to separate genera if they seemed to differ significantly from the type species. For instance Rhodora Linnaeus 1763 for , Vireya  1826 and Hymenanthes Blume 1826 for Rhododendron metternichii, now . Meanwhile, other botanists such as 1796 and Tate 1831 began to question the distinction between Azalea and Rhododendron, and finally in 1836, Azalea was incorporated into Rhododendron and the genus divided into eight sections. Of these Tsutsutsi , , , and are still used, the other sections being Lepipherum, Booram, and Chamaecistus. This structure largely survived till recently 2004, following which the development of molecular phylogeny led to major reexaminations of traditional morphological classifications, although other authors such as Candolle, who described six sections, used slightly different numeration.", "Soon, as more species became available in the nineteenth century so did a better understanding of the characteristics necessary for the major divisions. Chief amongst these were s Rhododendreae Asiae Orientali and . Maximovicz used flower bud position and its relationship with leaf buds to create eight Sections. used a similar scheme, but called the divisions Series. It was not until 1893 that appreciated the significance of scaling and hence the separation of lepidote and elepidote species. The large number of species that were available by the early twentieth century prompted a new approach when introduced the concept of grouping species into . The Species of Rhododendron referred to this series concept as the Balfourian system. That system continued up to modern times in Davidians four volume The Rhododendron Species.", "The next major attempt at classification was by who from 1934 began incorporating the Balfourian series into the older hierarchical structure of subgenera and sections, according to the , culminating in 1949 with his Ein System der Gattung Rhododendron and subsequent refinements. Most of the Balfourian series are represented by Sleumer as subsections, though some appear as sections or even subgenera. Sleumer based his system on the relationship of the flower buds to the leaf buds, habitat, flower structure, and whether the leaves were lepidote or nonlepidote. While Sleumers work was widely accepted, many in the United States and the United Kingdom continued to use the simpler Balfourian system of the Edinburgh group.", "Sleumers system underwent many revisions by others, predominantly the Edinburgh group in their continuing notes. Cullen of the Edinburgh group, placing more emphasis on the lepidote characteristics of the leaves, united all of the lepidote species into subgenus Rhododendron, including four of Sleumers subgenera Rhododendron, Pseudoazalea, Pseudorhodorastrum, Rhodorastrum. In 1986 Philipson  raised two sections of subgenus Aleastrum Mumeazalea, Candidastrum to subgenera, while reducing genus Therorhodion to a subgenus of Rhododendron. In 1987 Spethmann, adding features proposed a system with fifteen subgenera grouped into three chorus subgenera.", "A number of closely related genera had been included together with Rhododendron in a former tribe, Rhodoreae. These have been progressively incorporated into Rhododendron. Chamberlain and Rae moved the section Tsusiopsis together with the monotypic genus Tsusiophyllum into section Tsutsusi, while Kron  Judd reduced genus to a subsection of section Rhododendron. Then Judd  Kron moved two species  and  from section Brachybachii, subgenus Tsutsusi and two from section Rhodora, subgenus Pentanthera ,  into section Sciadorhodion, subgenus Pentanthera. Finally Chamberlain brought the various systems together in 1996, with 1,025 species divided into eight subgenera. Goetsch 2005 provides a comparison of the Sleumer and Chamberlain schemata Table 1.", "The era of molecular analysis rather than descriptive features can be dated to the work of Kurashige 1988 and Kron 1997 who used . Later Gao et al. 2002 used sequences to determine a analysis. They confirmed that the genus Rhododendron was , with subgenus Therorhodion in the , consistent with the matK studies. Following publication of the studies of Goetsch et al. 2005 with , there began an ongoing realignment of species and groups within the genus, based on evolutionary relationships. Their work was more supportive of Sleumers original system than the later modifications introduced by Chamberlain et al..", "The major finding of Goetsch and colleagues was that all species examined except , subgenus Therorhodion formed three major which they labelled A, B, and C, with the subgenera Rhododendron and Hymenanthes as monophyletic groups nested within clades A and B, respectively. By contrast subgenera Azaleastrum and Pentanthera were , while R. camtschaticum appeared as a to all other rhododendrons. The small polyphyletic subgenera Pentanthera and Azaleastrum were divided between two clades. The four sections of Pentanthera between clades B and C, with two each, while Azaleastrum had one section in each of A and C.", "Thus subgenera Azaleastrum and Pentanthera needed to be disassembled, and Rhododendron, Hymenanthes and Tsutsusi correspondingly expanded. In addition to the two separate genera included under Rhododendron by Chamberlain , Tsusiophyllum, Goetsch et al.. added clade C. Despite a degree of , the subgenus Rhododendron was otherwise untouched with regard to its three sections but four other subgenera were eliminated and one new subgenus created, leaving a total of five subgenera in all, from eight in Chamberlains scheme. The discontinued subgenera are Pentanthera, Tsutsusi, Candidastrum and Mumeazalea, while a new subgenus was created by elevating subgenus Azaleastrum section Choniastrum to subgenus rank.", "Subgenus Pentanthera deciduous azaleas with its four sections was dismembered by eliminating two sections and redistributing the other two between the existing subgenera in clades B Hymenanthes and C Azaleastrum, although the name was retained in section Pentanthera 14 species which was moved to subgenus Hymenanthes. Of the remaining three sections, monotypic Viscidula was discontinued by moving to Tsutsusi C, while Rhodora 2 species was itself polyphyletic and was broken up by moving to section Pentanthera B and to section Sciadorhodion, which then became a new section of subgenus Azaleastrum C.", "Subgenus Tsutsusi C was reduced to section status retaining the name, and included in subgenus Azaleastrum. Of the three minor subgenera, all in C, two were discontinued. The single species of subgenus Candidastrum  was moved to subgenus Azaleastrum, section Sciadorhodion. Similarly the single species in monotypic subgenus Mumeazalea  was placed in the new section Tsutsusi, subgenus Azaleastrum. Genus Menziesa 9 species was also added to section Sciadorhodion. The remaining small subgenus Therorhodion with its two species was left intact. Thus two subgenera, Hymenanthes and Azaleastrum were expanded at the expense of four subgenera that were eliminated, although Azaleastrum lost one section Choniastrum as a new subgenus, since it was a distinct subclade in A. In all, Hymenanthes increased from one to two sections, while Azaleastrum, by losing one section and gaining two increased from two to three sections. See schemata under .", "Subsequent research has supported the revision by Goetsch, although has largely concentrated on further defining the phylogeny within the subdivisions. In 2011 the two species of Diplarche were also added to Rhododendron, .", "This genus has been progressively subdivided into a hierarchy of subgenus, section, subsection, and species.", "Terminology from the Sleumer 1949 system is frequently found in older literature, with five subgenera and is as follows", "In the later traditional classification, attributed to Chamberlain 1996, and as used by and the , Rhododendron has eight subgenera based on , namely the presence of scales lepidote, of leaves, and the floral and vegetative branching patterns, after Sleumer 1980. These consist of four large and four small subgenera. The first two subgenera Rhododendron and Hymenanthes represent the species commonly considered as Rhododendrons. The next two smaller subgenera Pentanthera and Tsutsusi represent the Azaleas. The remaining four subgenera contain very few species. The largest of these is subgenus Rhododendron, containing nearly half of all known species and all of the lepidote species.", "For a comparison of the Sleumer and Chamberlain systems, see Goetsch et al. 2005 Table 1.", "This division was based on a number of what were thought to be key morphological characteristics. These included the position of the inflorescence buds terminal or lateral, whether lepidote or elepidote, deciduousness of leaves, and whether new foliage was derived from from previous years shoots or the lowest scaly leaves.", "Following the of Goetsch et al. 2005 this scheme was simplified, based on the discovery of three major A, B, C as follows.", "Clade A", "Clade B", "Clade C", "The larger subgenera are further subdivided into sections and subsections Some subgenera contain only a single section, and some sections only a single subsection. Shown here is the traditional classification, with species number after Chamberlain 1996, but this scheme is undergoing constant revision. Revisions by Goetsch et al. 2005 and by Craven et al. 2008 shown in parenthetical italics. Older ranks such as Series groups of species are no longer used but may be found in the literature, but the American Rhododendron Society still uses a similar device, called Alliances", "The system used by the as of December 2023 uses six subgenera, four of which are divided further", "Species of the genus Rhododendron are widely distributed between latitudes 80N and 20S and are to areas from North America to , , and , and from to , and the . The are in the and , with the greatest species diversity in the SinoHimalayan region, Southwest China and northern , from India  , , and to , northwestern and western and southeastern . Other significant areas of diversity are in the mountains of , and . More than 90 of Rhododendron sensu Chamberlain belong to the Asian subgenera Rhododendron, Hymenanthes and section Tsutsusi. Of the first two of these, the species are predominantly found in the area of the Himalayas and Southwest China SinoHimalayan Region.", "The 300 species within the section of subgenus Rhododendron occupy the from their presumed Southeast Asian origin to Northern Australia, with 55 known species in and 164 in . The species in New Guinea are native to moist at around 3,000 metres above sea level in the Central Highlands. Subgenera Rhododendron and Hymenanthes, together with section Pentanthera of subgenus Pentanthera are also represented to a lesser degree in the Mountainous areas of North America and . Subgenus Tsutsusi is found in the maritime regions of Japan, Korea, Taiwan, , but not in North America or Eurasia.", "In the United States, native Rhododendron mostly occur in lowland and montane forests in the , , the , and the .", "has become invasive in and the . It is an introduced species, spreading in woodland areas and replacing the natural understory. R. ponticum is difficult to eradicate, as its roots can make new shoots.", "A number of insects either target rhododendrons or will opportunistically attack them. Rhododendron borers and various are major pests of rhododendrons, and many will preferentially devour them.", "Rhododendron species are used as food plants by the  of some and  see List of Lepidoptera that feed on rhododendrons.", "Major diseases include root rot, stem and twig fungal dieback.", "Rhododendron bud blast, a fungal condition that causes buds to turn brown and dry before they can open, is caused by the fungus Pycnostysanus azaleae, which may be brought to the plant by the rhododendron leafhopper, Graphocephala fennahi. 562", "In the UK the forerunner of the Rhododendron, Camellia and Magnolia Group RCMG, The Rhododendron Society was founded in 1916. while in Scotland species are being conserved by the Rhododendron Species Conservation Group.", "Both species and hybrid rhododendrons including azaleas are used extensively as in in many parts of the world, including both and regions. Many species and cultivars are grown commercially for the trade.", "Rhododendrons can be propagated by air layering or stem cuttings. 540541 They can selfpropagate by sending up shoots from the roots. Sometimes an attached branch that has drooped to the ground will root in damp mulch, and the resulting rooted plant then can be cut off the parent rhododendron. They can also be reprodcued by seed dispersal  or by horticulturalists collecting the spent flower buds and saving ad drying the seed for later germination and planting.", "Rhododendrons are often valued in landscaping for their structure, size, flowers, and the fact that many of them are evergreen. Azaleas are frequently used around foundations and occasionally as hedges, and many largerleafed rhododendrons lend themselves well to more informal plantings and , or as specimen plants. In some areas, larger rhododendrons can be pruned to encourage more treelike form, with some species such as and eventually growing to a height of 1015 m 32.8149.21 ft or more.", "Rhododendrons are grown commercially in many areas for sale, and seeds were occasionally collected in the wild, a practice now rare in most areas due to the Nagoya Protocol. Larger commercial growers often ship long distances in the United States, most of them are on the west coast Oregon, Washington state and California. Largescale commercial growing often selects for different characteristics than hobbyist growers might want, such as resistance to root rot when overwatered, ability to be forced into budding early, ease of rooting or other propagation, and saleability.", "Horticulturally, rhododendrons may be divided into the following groups", "Like other plants, most rhododendrons prefer acid soils with a pH of roughly 4.55.5 some tropical Vireyas and a few other rhododendron species grow as and require a planting mix similar to . Rhododendrons have fibrous roots and prefer welldrained soils high in organic material. In areas with poorly drained or alkaline soils, rhododendrons are often grown in raised beds using media such as composted pine bark. Mulching and careful watering are important, especially before the plant is established.", "A new stock of rhododendrons trademarked as Inkarho has been exhibited at the in London 2011. Individual hybrids of rhododendrons have been on to a on a single rhododendron plant that was found growing in a chalk quarry. The rootstock is able to grow in calciumrich soil up to a pH of 7.5.", "Rhododendrons are extensively hybridized in cultivation, and natural hybrids often occur in areas where species ranges overlap. There are over 28,000 of Rhododendron in the International Rhododendron Registry held by the . Most have been bred for their flowers, but a few are of garden interest because of ornamental leaves and some for ornamental bark or stems. Some hybrids have fragrant flowerssuch as the Loderi hybrids, created by crossing and . Other examples include the PJM hybrids, formed from a cross between and , and named after Peter J. Mezitt of Weston Nurseries, Massachusetts.", "Some species of rhododendron are poisonous to grazing animals because of a called in their and . People have been known to become ill from eating made by feeding on rhododendron and flowers. described the odd behaviour of soldiers after having consumed honey in a village surrounded by during the march of the in 401 BCE. s soldiers reportedly suffered lethal casualties following the consumption of deliberately left behind by forces in 67 BCE during the . Later, it was recognized that honey resulting from these plants has a slightly and effect. The suspect rhododendrons are and formerly Azalea pontica, both found in northern . Eleven similar cases during the 1980s have been documented in , . Rhododendron is extremely toxic to horses, with some animals dying within a few hours of ingesting the plant, although most horses tend to avoid it if they have access to good forage. Rhododendron, including its stems, leaves and flowers, contains toxins that, if ingested by a cats stomach, can cause seizures and even coma and death.", "Rhododendron species have long been used in traditional medicine. Animal studies and research have identified possible antiinflammatory and hepatoprotective activities which may be due to the antioxidant effects of or other and the plant contains. Xiong et al. have found that the root of the plant is able to reduce the activity of in rats.", "In , the flower is considered edible and enjoyed for its sour taste. The pickled flower can last for months and the flower juice is also marketed. 51 The flower, fresh or dried, is added to fish curry in the belief that it will soften the bones. 53 The juice of rhododendron flower is used to make a called burans named after the flower in the hilly regions of . It is admired for its distinctive flavor and color.", "The called Labrador tea not a true  is made from one of three closely related species", "In , in , the Buransh flower is deeply embedded in local culture, playing a significant role in festivals like Holi and weddings, where it is used in garlands and decorations to bless attendees. The flower is also utilized in making a healthful, rich juice that is popular during local festivities and summer months. Additionally, Buransh flowers are incorporated into local arts and crafts, where they are used to make colorful necklaces and jewelry, symbolizing the spiritual and physical prosperity of the community.", "The rhododendron is the national flower of Nepal.", "In the , the rhododendron symbolizes danger and to beware.", "lali guransh is the national flower of . R. ponticum is the of and . is the state tree of in . Rhododendron arboreum is also the state tree of the state of , India. Pink Rhododendron  is the state flower of , India. Rhododendron is also the provincial flower of Jiangxi, China and the state flower of , the 16th state of the Indian Union.", ", the most widespread rhododendron of the , is the state flower of the US state of , and is in the .", ", a widespread rhododendron of the , is the state flower of the US state of .", "Amongst the tribes in and , Rhododendrons called Ngeisok is used in a poetic manner to signify a lady.", "The nineteenthcentury American poet and essayist Ralph Waldo Emerson in 1834 wrote a poem titled The Rhodora, On Being Asked, Whence Is the Flower.", "Rhododendrons play a role and are soliloquized in s . The flowers are referenced throughout s novel 1938 and in s novel 1994. British author also uses rhododendron as a motif throughout many of his books, e.g. the series and 2009.", "The effects of R. ponticum were mentioned in the 2009 film as a proposed way to arrange a . It was also mentioned in the third episode of Season 2 of BBCs , speculated to have been a part of Sherlocks fake death scheme.", "Records of the Rhododendron Society of America reside at the at the University of Virginia.", "Our editors will review what youve submitted and determine whether to revise the article.", "azalea, certain species of of the heath family , formerly placed in the genus Azalea. Many azaleas are grown as ornamentals for their showy flowers, and most of the varieties have been bred from species that are native to the hilly regions of Asia and .", "Azaleas are typically deciduous while other rhododendrons are evergreen. Azalea are funnelshaped, somewhat twolipped, and often fragrant. Flowers of rhododendrons, on the other hand, are more often bellshaped. Azalea flowers typically have only 5 projecting , as compared with 10 or more in rhododendrons. Intermediate forms, however, do occur.", "Wellknown North American kinds include the smooth, or sweet, azalea R. arborescens, a fragrant whiteflowering 3 to 6 metres about 10 to 20 feet high the flame azalea R. calendulaceum, a shrub 0.5 to 2 metres 1.5 to 6.5 feet high and the pinxter flower R. periclymenoides, a shrub 1 to 2 metres 3 to 6.5 feet high, with to whitish flowers. Hundreds of horticultural forms have been bred, including the R. molle, the Yodogawa azalea R. yedoense, and the torch azalea R. kaempferi.", "From plants that wake when others sleep, from timid jasmine buds that keep their odour to themselves all day, but when the sunlight dies away let the delicious secret out to every breeze that roams about. Poet Thomas Moore described the intoxicating fragrance of nightblooming jasmine as a delicious secret because of its unusual bloom habits. What is nightblooming jasmine? Read more for that answer, as well as tips for growing night jasmine plants.", "Commonly known as nightblooming jasmine, nightblooming jessamine, or ladyofthenight Cestrum nocturnum, it is not a true , at all, but is a jessamine plant of which are members of the along with tomatoes and peppers. Jessamine plants are oftentimes referred to as jasmines because of their highly fragrant flowers and because their names are so similar. Like jasmine, jessamine plants can be shrubs or vines. Nightblooming jessamine is a tropical, evergreen shrub. Nightblooming jasmine grows 810 feet 2.53 m. tall and 3 feet 91.5 cm. wide. Its evergreen nature and tall but columnar growth habit make nightblooming jasmine an excellent candidate for and . It bears clusters of small, whitegreen flowers from spring through late summer. When the flowers fade, white berries form and attract a variety of birds to the garden. The overall appearance of nightblooming jasmine is nothing spectacular. However, when the sun sets, nightblooming jasmines small, tubular flowers open, releasing a heavenly fragrance throughout the garden. Because of this scent, nightblooming jessamine is commonly planted near the home or patio where its perfume can be enjoyed.", "Night jessamine grows best in to . Too much shade may cause a lack of blooms, which means a lack of the sweet fragrance its night blooms provide. Nightblooming jasmines are not particular about soil, but they do need to be watered regularly during their first season. Once established, nightblooming jasmine care is minimal and they are relatively drought tolerant. They are hardy in zones 911. In cooler climates, nightblooming jasmines can be enjoyed as potted plants, which can be moved indoors during winter. Plants can be pruned after flowering to shape or control their size. Nightblooming jessamine is a tropical plant, native to the Caribbean and West Indies. In its natural environment, the nighttime blooms are pollinated by moths, bats, and nightfeeding birds.", "Sign up for the Gardening Know How newsletter today and receive a free download of our DIY eBook Bring Your Garden Indoors 13 DIY Projects For Fall And Winter.", "Gardening Know How is part of Future plc, an international media group and leading digital publisher. .  Future US, Inc. Full 7th Floor, 130 West 42nd Street, New York, NY 10036.", "Golden dewdrop Duranta erecta is an evergreen shrub or small tree that makes an exciting backdrop or privacy barrier. The Latin name erecta means upright and the common name golden dewdrop references the showy yellow fruits that cascade from the plant in the summer. Its origin is debated, but golden dewdrop may be native to Florida or the West Indies and Central America.", "Golden dewdrop sports bright green, oval leaves with serrated margins. Branches are irregular and drooping, particularly when adorned with fountains of flowers and the fruits that follow.", "There are several cultivars of golden dewdrop. Most commonly seen is Gold Mound with its goldenyellow leaves, or the highly ornamental Sapphire Shower with purple flowers. There is also a variegated cultivar called Variegata with white or yellowedged leaves for added interest.", "The tree grows to a maximum height of eight to 15 feet with a spread of 10 to 15 feet. Golden dewdrop often has multiple small trunks. Plants are hardy in USDA zones 9B through 11, although temperatures in the low forties can cause leaves to turn a purple hue. Even if it experiences cold damage, golden dewdrop will bounce back in the spring.", "In addition to bright foliage, golden dewdrop also provides tubular flowers that range in color from purple, to white, to blue. The flowers are clustered in a form called raceme that, from a distance, resembles a bunch of grapes. They appear in the spring and summer, followed by striking yellow drupes. Flowers and fruits can be seen simultaneously, making the plant particularly showy. The fruits are typically half an inch in diameter and hang from the plant like densely clustered strands of pearls.", "Fruits can remain on the tree into the winter, providing a pop of color to a dull landscape. That is, if theyre not removed by wildlife. The fruits may look tantalizing, but theyre actually poisonous to humans. However, birds will happily devour the golden feast provided by the tree. The flowers will also attract butterflies.", "Golden dewdrop is tolerant of most soil types but cannot survive salt. The tree will grow in partial shade, but thrives in full sun. It is also drought tolerant, so only water your tree occasionally. Golden dewdrop works well as a screen or backdrop plant, but its height means it should not be planted in cramped areas or next to homes.", "Pest problems are typically not serious, but potential offenders are caterpillars, nematodes, and scale. Diseases are also not a concern. Contact for advice if you notice any severe issues.", "Your cart is currently empty.", "Golden Dewdrop Plant Features", "Golden Dewdrop Growing Instructions", "Water", "Medium water needs", "Light", "Outside Part sun", "Outside Shade", "Outside Sun", "Colors", "Blue", "Variegated", "White", "Special Features", "Attracts butterflies", "Colorful foliage", "Supereasy to grow"]