["Introduction to Information Retrieval Data Data is raw, unorganized facts and figures anddefined as tructured, semi- structured or unstructured information such as text, observations, images, symbols, and descriptions", "Information Information refers to processed, organized, and structured data. It gives context for the facts and facilitates decision making. In other words, information is processed data that makes sense to us", "Types of Data Highly organized data with a predefined format, typically stored in relational databases. It follows a rigid schema with rows and columns", "Structured Data Characteristics: Easily searchable and queryable", "Efficient for analysis and reporting", "Examples: CSV files, Excel spreadsheets, SQL databases", "Use Cases: Financial data Customer demographics Sales figures Introduction to Information Retrieval 1Semi-Structured Data Data that exhibits some organizational properties but doesn't conform to a strict data modellike structured data. It often contains tags or markers to separate semantic elements", "Characteristics: ● More flexible than structured data", "● Can be processed using specialized tools", "● Examples: XML, JSON, CSV without predefined schema", "Use Cases: ● Social media feeds ● Sensor data ● Log files Unstructured Data Data without a predefined data model or organization. It's raw and unorganized", "Characteristics: ● Challenging to process and analyze", "● Requires advanced techniques like machine learning and natural language processing", "● Examples: Text documents, images, audio, video, social media posts", "Use Cases: ● Text analysis ● Image recognition ● Speech recognition Information Retrieval Information retrieval IR is finding material (usually documents) of an unstructured nature (usually text) that satisfies an information need from within large collections (usually stored on computers)", "deals with the representation, storage, organization of, and access to information items", "Introduction to Information Retrieval 2The representation and organization of the information items should provide the user with easy access to the information in which he/she is interested", "Difference between IR and DR Application of IR Web Search The most common application, powering search engines like Google, Bing, and Yahoo. Enables users to find information, products, services, and people online", "Enterprise Search Helps employees locate relevant information within an organization's internal systems, such as documents, emails, databases, and intranets", "Digital Libraries Introduction to Information Retrieval 3Facilitates searching and retrieving books, articles, research papers, and other digital content", "E-commerce Enables users to find products based on keywords, categories, and filters", "Recommender systems often utilize IR techniques to suggest products based on user preferences and purchase history", "Bioinformatics Searching and analyzing biological data, such as DNA sequences and protein structures", "Legal Finding relevant case law, statutes, and legal documents", "Intelligence Analyzing text data for information extraction and intelligence gathering", "History of Information Retrieval (IR) The history of Information Retrieval IR spans a fascinating journey, beginning long before the advent of modern computing. Its roots lie in early efforts to organize and retrieve information manually, which laid the groundwork for today's sophisticated search technologies", "Pre-Computer Era The earliest forms of IR can be traced back to ancient civilizations like Egypt and Greece, where libraries served as hubs of knowledge. Early systems for organizing information included manual indexing methods, which revolutionized the way books were cataloged and accessed. In the late 19th century, mechanical aids such as punched cards began emerging, providing the first glimpses of automated data processing", "Introduction to Information Retrieval 4Early Computational Methods The mid-20th century witnessed the rise of computers, which transformed IR", "Initial experiments, like IBMʼs Selective Dissemination of Information SDI, explored using computers for storing and retrieving information. The Boolean retrieval model, based on logical operators like AND, OR, and NOT, became a cornerstone of early systems. Researchers also introduced techniques like relevance feedback, allowing users to refine search results iteratively", "Growth and Commercialization The 1970s and 1980s marked a period of rapid growth in IR. Commercial systems such as DIALOG and LexisNexis provided access to large databases of documents, enabling professionals to conduct real-time interactive searches", "Evaluation metrics like precision and recall were introduced to measure system effectiveness, and user interfaces began evolving to simplify query construction", "Modern Era With the advent of the World Wide Web in the 1990s, IR faced new challenges and opportunities. Search engines like AltaVista, Yahoo, and later Google redefined how information was retrieved, using advanced algorithms like PageRank to rank web pages by relevance. The scope of IR also expanded to include multimedia retrieval, incorporating images, audio, and video alongside text. Natural Language Processing NLP became integral, improving systems' understanding of user intent", "Information Retrieval in a Broader and Narrow Sense Broader Sense of IR In its broader sense, IR encompasses the entire discipline of finding and organizing information that meets people's needs. This perspective includes not just the technical aspects of search systems but also the underlying motivation for human knowledge discovery. It covers a wide range of tasks such as classification, clustering, recommendation systems, social network analysis, question answering, and human-computer interaction. For instance, fields like Introduction to Information Retrieval 5psychology and cognitive science play roles in understanding how users interact with IR systems", "Broadly defined, IR is a response to information overload, where the goal is to identify relevant knowledge from vast data repositories. Applications go beyond traditional document retrieval, addressing challenges in areas like digital libraries, bioinformatics, and social media analysis", "Narrow Sense of IR In a narrower sense, IR is more focused on \"search\"—specifically, designing algorithms and systems to locate information within large collections of materials", "This includes text documents, multimedia content, or structured data, but the emphasis is on the computational and algorithmic aspects of retrieval. Here, the user initiates the process by expressing an information need through a query, and the system responds with ranked results based on relevance", "For example, a web search engine retrieves web pages in response to a keyword query. The documents are ranked using retrieval models like vector space or probabilistic models, prioritizing the most relevant results. This narrower definition emphasizes the technical implementation of search systems and their performance optimization, often evaluated through metrics such as precision, recall, and F1 score", "Components of IR Introduction to Information Retrieval 6Information Need The search process begins with the user's information need, which motivates the query", "This need is often referred to as a “topicˮ in IR evaluations", "Query Construction Users express their information need as a query, typically consisting of a few terms (e.g., 23 terms for a web search)", "Introduction to Information Retrieval 7Queries can include diverse elements like dates, numbers, phrases, and wildcard operators (e.g., “inform*ˮ matching “informˮ, “informativeˮ, etc.)", "Query Syntax While most users use simple keyword queries, IR systems can support complex Boolean and pattern-matching queries to refine searches, restrict to specific fields, or apply filters", "User Interface The interface mediates between the user and the IR system, simplifying query creation, especially when advanced query syntax is used", "Search Engine Components The search engine, whether local or remote, processes the userʼs query. It relies heavily on an inverted index, which maps terms to their occurrences in documents", "Relevance Ranking and Result Processing The engine calculates a relevance score, often termed as the Retrieval Status Value RSV, to rank documents", "The ranked list undergoes further processing, such as removing duplicate or redundant results (e.g., showing only one result per domain in web searches)", "Traditional IRS Introduction to Information Retrieval 8Acquisition: Documents are gathered from various sources like websites, databases, and other repositories. These include text documents (titles, abstracts) and other formats like images or statistics", "Representation: Documents are indexed using techniques such as: Free-text terms (terms from the full text)", "Controlled vocabulary (e.g., thesaurus-based terms)", "Metadata (author, title, publication date)", "File Organization: Documents and indexes are organized for efficient retrieval", "Common approaches include sequential and inverted indexing", "Problem Representation: The userʼs task or query is translated into an information need, which may evolve during the search process", "Query Construction: The user creates a query, which is processed and formatted for the system using stemmed keywords, logical operators, and relevance feedback", "Introduction to Information Retrieval 9Matching Algorithms: Methods like Boolean retrieval (exact match), best match (relevance ranking), or hybrids are used", "Output and Ranking: Documents are ranked by relevance and displayed to the user, often accompanied by mechanisms for feedback and iterative refinement of the search process", "Process of Information Retrieval Three Big Issues in Information Retrieval (IR) Information Retrieval IR systems face several challenges that affect their efficiency and effectiveness. Three critical issues are relevance, evaluation, and user-centered design", "\u0000Relevance: Relevance is the cornerstone of IR, defining how well a document satisfies a user's information need: A document is considered relevant if it contains the information a user was looking for when submitting a query", "Relevance depends on various factors, including context, user intent, and the relationship between the query and document content", "Introduction to Information Retrieval 10\u0000Evaluation: Evaluating IR systems is essential for assessing their performance and improving retrieval effectiveness: Precision: Proportion of retrieved documents that are relevant", "Recall: Proportion of relevant documents retrieved from the entire collection", "F1Score: A harmonic mean of precision and recall, balancing both measures", "\u0000Emphasis on Users and Their Information Needs: Users are the ultimate judges of an IR systemʼs quality, making user-centered design a critical focus: Users often submit ambiguous or vague queries, such as single-word terms, that lack specificity or context", "Introduction to Information Retrieval 11"]